In [1]:
import pandas as pd
import numpy as np

In [5]:
pd.Series(["Male", "Female", "Male", "Male", "Female", "Female", "Male"])

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6      Male
dtype: object

In [13]:
ser = pd.Series(np.array(["Male", "Female", "Male", "Male", "Female", "Female", "Male"]))

In [15]:
type(ser)

pandas.core.series.Series

In [17]:
dict_data = {"a": 1, "b":2, "c":3}

In [19]:
pd.Series(dict_data)

a    1
b    2
c    3
dtype: int64

In [21]:
pd.Series({111: 1, 222:2, 333:3})

111    1
222    2
333    3
dtype: int64

In [23]:
ser

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6      Male
dtype: object

In [25]:
ser.index

RangeIndex(start=0, stop=7, step=1)

In [29]:
list(ser.index)

[0, 1, 2, 3, 4, 5, 6]

In [31]:
ser2 = pd.Series({111: 1, 222:2, 333:3})

In [33]:
ser2.index

Index([111, 222, 333], dtype='int64')

In [35]:
ser.values

array(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male'],
      dtype=object)

In [37]:
ser

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6      Male
dtype: object

In [39]:
ser.dtype

dtype('O')

In [41]:
list_data = ["2019-01-30", 3.14, "ABC", 100, True]

In [43]:
ser2 = pd.Series(list_data)

In [45]:
ser2

0    2019-01-30
1          3.14
2           ABC
3           100
4          True
dtype: object

In [47]:
ser2.index

RangeIndex(start=0, stop=5, step=1)

In [49]:
ser2.values

array(['2019-01-30', 3.14, 'ABC', 100, True], dtype=object)

In [51]:
d = {
    "Name": ["Braund", "Henry", "Elizabeth"],
    "Age": [22, 35, 58],
    "Sex": ["male", "male", "female"]
}

In [73]:
df = pd.DataFrame(d)
df

        Name  Age     Sex
0     Braund   22    male
1      Henry   35    male
2  Elizabeth   58  female

In [75]:
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [57]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [59]:
type(df["Age"])

pandas.core.series.Series

In [61]:
df["Age"][0]

22

In [65]:
pd.DataFrame( {
    "Name": {0: "Braund", 1: "Henry", 2: "Elizabeth"},
    "Age": {2: 22, 0:35, 1:58},
    "Sex": {0:"male", 1:"male", 2:"female"}
})

        Name  Age     Sex
0     Braund   35    male
1      Henry   58    male
2  Elizabeth   22  female

In [67]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [71]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [77]:
eye = pd.Series({
  "Brown": 220,
    "Blue": 215,
    "Hazel": 93,
    "Green": 64
})
eye

Brown    220
Blue     215
Hazel     93
Green     64
dtype: int64

In [79]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [83]:
eye.name

In [85]:
eye.name = "eye_color"

In [89]:
eye

Brown    220
Blue     215
Hazel     93
Green     64
Name: eye_color, dtype: int64

In [91]:
eye.values

array([220, 215,  93,  64], dtype=int64)

In [93]:
eye.sort_values()

Green     64
Hazel     93
Blue     215
Brown    220
Name: eye_color, dtype: int64

In [99]:
eye.sort_index(inplace=True)

In [101]:
eye

Blue     215
Brown    220
Green     64
Hazel     93
Name: eye_color, dtype: int64

In [103]:
eye.unique()

array([215, 220,  64,  93], dtype=int64)

In [105]:
eye.nunique()

4

In [107]:
len(eye.unique())

4

In [109]:
my_data2 = [220,215, 93, 64, 64]

In [111]:
eye2 = pd.Series(my_data2, index=["Brown", "Blue", "Blue", "Hazel", "Green"])
eye2

Brown    220
Blue     215
Blue      93
Hazel     64
Green     64
dtype: int64

In [113]:
eye2.unique()

array([220, 215,  93,  64], dtype=int64)

In [115]:
eye2.nunique()

4

In [117]:
eye2.value_counts()

64     2
220    1
215    1
93     1
Name: count, dtype: int64

In [129]:
ser = pd.Series([0,10,20,30,40], index=['Jose','Ana','Pedro','Abel','Luis']
               )
ser

Jose      0
Ana      10
Pedro    20
Abel     30
Luis     40
dtype: int64

In [131]:
ser[1]

C:\Users\cfp\AppData\Local\Temp\ipykernel_12900\4267038266.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[1]

10

In [133]:
ser['Ana']

10

In [135]:
ser[1:3]

Ana      10
Pedro    20
dtype: int64

In [137]:
ser["Ana":"Abel"]

Ana      10
Pedro    20
Abel     30
dtype: int64

In [139]:
ser1 = pd.Series([0,1,2,3,4], index=[0,1,2,3,4])
ser2 = pd.Series([0,1,2,3,4], index=[4,3,2,1,0])

In [141]:
ser1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [143]:
ser2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [145]:
ser1+ser2

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [147]:
ser1*ser2

0    0
1    3
2    4
3    3
4    0
dtype: int64

In [149]:
ser1/ser2

0    0.000000
1    0.333333
2    1.000000
3    3.000000
4         inf
dtype: float64

In [151]:
ser

Jose      0
Ana      10
Pedro    20
Abel     30
Luis     40
dtype: int64

In [153]:
ser1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [155]:
ser+ser1

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
Abel    NaN
Ana     NaN
Jose    NaN
Luis    NaN
Pedro   NaN
dtype: float64

In [157]:
ser1.sum()

10

In [159]:
ser1.median()

2.0

In [161]:
ser1.mean()

2.0

In [163]:
ser1.max()

4

In [165]:
ser1.min()

0

In [167]:
ser1.std()

1.5811388300841898

In [169]:
ser1.sort_values()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [171]:
ser_height = pd.Series([160,170,180], name="height")
ser_height

0    160
1    170
2    180
Name: height, dtype: int64

In [179]:
ser_height.apply(lambda x: x+10)

0    170
1    180
2    190
Name: height, dtype: int64

In [175]:
ser_height

0    160
1    170
2    180
Name: height, dtype: int64

In [181]:
def suma_10(x):
    return x+10

In [183]:
ser_height.apply(suma_10)

0    170
1    180
2    190
Name: height, dtype: int64

# Iris dataset

In [4]:
iris_df = pd.read_csv("iris.csv")
iris_df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [6]:
type(iris_df)

pandas.core.frame.DataFrame

In [8]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [193]:
iris_df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [10]:
iris_df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [30]:
iris_df.columns = ["Sepal_Length", "Sepal_Width", "Petal_Length", "Petal_Width", "Variety"]

In [32]:
iris_df.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [34]:
iris_df["Sepal_Length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [36]:
iris_df.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [38]:
iris_df[["Sepal_Length", "Petal_Length"]]

     Sepal_Length  Petal_Length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [40]:
df = pd.DataFrame([["Name", "Age", "Sex", "School"], ["Tom", 15, "male", "middle"], ["Alice", 10, "female", "elementary"]])
df

       0    1       2           3
0   Name  Age     Sex      School
1    Tom   15    male      middle
2  Alice   10  female  elementary

In [42]:
df = pd.DataFrame([["Tom", 15, "male", "middle"], ["Alice", 10, "female", "elementary"]], columns=["Name", "Age", "Sex", "School"])
df

    Name  Age     Sex      School
0    Tom   15    male      middle
1  Alice   10  female  elementary

In [44]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [54]:
df.index = ["stu1", "stu2"]
df

       Name  Age     Sex      School
stu1    Tom   15    male      middle
stu2  Alice   10  female  elementary

In [58]:
df.rename(index={"stu1": "student1", "stu2": "student2"}, inplace=True)
#df = df.rename(index={"stu1": "student1", "stu2": "student2"})
df

           Name  Age     Sex      School
student1    Tom   15    male      middle
student2  Alice   10  female  elementary

In [60]:
df.rename(columns={"Name": "name", "Age": "age", "Sex": "sex", "School": "school"}, inplace=True)
df

           name  age     sex      school
student1    Tom   15    male      middle
student2  Alice   10  female  elementary

In [64]:
df.rename(columns={"name": "Name", "age": "Age", "sex": "Sex", "school": "School"},
          index={"student1": "Student1"},
          inplace=True)
df

           Name  Age     Sex      School
Student1    Tom   15    male      middle
student2  Alice   10  female  elementary

In [66]:
exam_data = {"math": [90,80,70], "eng": [98,89,85], "music": [85,95,100], "science": [100,90,90]}
exam_data

{'math': [90, 80, 70],
 'eng': [98, 89, 85],
 'music': [85, 95, 100],
 'science': [100, 90, 90]}

In [68]:
df = pd.DataFrame(exam_data, index=["stu1", "stu2", "stu3"])
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   85    100       90

In [70]:
df2 = df[:]

In [72]:
id(df), id(df2)

(1686090250432, 1686090248848)

In [74]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   85    100       90

In [76]:
df2.drop("stu2", inplace=True)
df2

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\855721902.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop("stu2", inplace=True)

      math  eng  music  science
stu1    90   98     85      100
stu3    70   85    100       90

In [78]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   85    100       90

In [90]:
df3 = df[:]

In [92]:
df3.drop(["stu2", "stu3"], axis=0, inplace=True)
df3

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\3922166319.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(["stu2", "stu3"], axis=0, inplace=True)

      math  eng  music  science
stu1    90   98     85      100

In [94]:
df4 = df[:]

In [96]:
df4.drop("math", axis=1, inplace=True)
df4

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\2027974545.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop("math", axis=1, inplace=True)

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   85    100       90

In [98]:
df5 = df[:]

In [100]:
df5.drop(["eng", "science"], axis=1, inplace=True)
df5

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\782546458.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(["eng", "science"], axis=1, inplace=True)

      math  music
stu1    90     85
stu2    80     95
stu3    70    100

In [102]:
df.loc["stu1"]

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [104]:
df.iloc[0]

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [106]:
df.math

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [108]:
df.loc["stu1"]

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [110]:
df.loc[["stu1", "stu2"]]

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [112]:
df.iloc[[0,1]]

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [114]:
math1 = df.math

In [116]:
math1

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [118]:
music_sci = df[["music", "science"]]
music_sci

      music  science
stu1     85      100
stu2     95       90
stu3    100       90

In [120]:
df["math"]

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [122]:
df[["math"]]

      math
stu1    90
stu2    80
stu3    70

In [417]:
exam_data = {
    "name": ["hongildong", "hongeeedong", "honsamdong"],
    "math": [90,80,70],
    "eng": [98,89,95],
    "music": [85,95,100],
    "phys_tra": [100,90,90]
}



df = pd.DataFrame(exam_data)
df

          name  math  eng  music  phys_tra
0   hongildong    90   98     85       100
1  hongeeedong    80   89     95        90
2   honsamdong    70   95    100        90

In [126]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [128]:
df.set_index("name", inplace=True)
df

             math  eng  music  phys_tra
name
hongildong     90   98     85       100
hongeeedong    80   89     95        90
honsamdong     70   95    100        90

In [130]:
df.index

Index(['hongildong', 'hongeeedong', 'honsamdong'], dtype='object', name='name')

In [132]:
df.loc["hongildong", "music"]

85

In [134]:
df.loc[["hongildong", "hongeeedong"]]

             math  eng  music  phys_tra
name
hongildong     90   98     85       100
hongeeedong    80   89     95        90

In [136]:
df.loc["hongildong", ["music", "phys_tra"]]

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [138]:
df.iloc[0, 0]

90

In [140]:
df.iloc[0, [2,3]]

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [142]:
df.loc["hongildong", "eng":"phys_tra"]

eng          98
music        85
phys_tra    100
Name: hongildong, dtype: int64

In [144]:
df.iloc[0, 2:]

music        85
phys_tra    100
Name: hongildong, dtype: int64

In [146]:
df.loc[["hongildong", "hongeeedong"], ["music", "phys_tra"]]

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [148]:
df.iloc[[0,1],[2,3]]

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [152]:
df.loc["hongildong":"hongeeedong", "music":"phys_tra"]

             music  phys_tra
name
hongildong      85       100
hongeeedong     95        90

In [154]:
df.music

name
hongildong      85
hongeeedong     95
honsamdong     100
Name: music, dtype: int64

In [158]:
df["kor"] = 80
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
honsamdong     70   95    100        90   80

In [160]:
df.loc[3] = 0
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
honsamdong     70   95    100        90   80
3               0    0      0         0    0

In [162]:
df.loc[3] = [90,80,70,60,77]
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
honsamdong     70   95    100        90   80
3              90   80     70        60   77

In [164]:
df.index

Index(['hongildong', 'hongeeedong', 'honsamdong', 3], dtype='object', name='name')

In [166]:
df.index[3]

3

In [168]:
df = df.reset_index()
df

          name  math  eng  music  phys_tra  kor
0   hongildong    90   98     85       100   80
1  hongeeedong    80   89     95        90   80
2   honsamdong    70   95    100        90   80
3            3    90   80     70        60   77

In [170]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [172]:
df.iloc[3,0] = "hongsadong"
df

          name  math  eng  music  phys_tra  kor
0   hongildong    90   98     85       100   80
1  hongeeedong    80   89     95        90   80
2   honsamdong    70   95    100        90   80
3   hongsadong    90   80     70        60   77

In [174]:
df.set_index("name", inplace=True)
df

             math  eng  music  phys_tra  kor
name
hongildong     90   98     85       100   80
hongeeedong    80   89     95        90   80
honsamdong     70   95    100        90   80
hongsadong     90   80     70        60   77

In [176]:
exam_data = {
    "name": ["stu1", "stu2", "stu3"],
    "math": [90,80,70],
    "eng": [98,89,95],
    "mus": [85,95,100],
    "phy": [100,90,90]
}
df = pd.DataFrame(exam_data)
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [178]:
df.set_index("name", inplace=True)
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [180]:
df.iloc[0][3] = 80
df

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\197081377.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\197081377.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80

      math  eng  mus  phy
name
stu1    90   98   85   80
stu2    80   89   95   90
stu3    70   95  100   90

In [182]:
df.iloc[0,3] = 81
df

      math  eng  mus  phy
name
stu1    90   98   85   81
stu2    80   89   95   90
stu3    70   95  100   90

In [186]:
df.loc["stu1"]["phy"] = 90
df

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\1153491615.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc["stu1"]["phy"] = 90

      math  eng  mus  phy
name
stu1    90   98   85   90
stu2    80   89   95   90
stu3    70   95  100   90

In [188]:
df.loc["stu1", "phy"] = 100
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [190]:
df.loc["stu1", ["mus", "phy"]] = 50
df

      math  eng  mus  phy
name
stu1    90   98   50   50
stu2    80   89   95   90
stu3    70   95  100   90

In [196]:
df.loc["stu1", ["mus", "phy"]] = 90, 100
df

      math  eng  mus  phy
name
stu1    90   98   90  100
stu2    80   89   95   90
stu3    70   95  100   90

In [198]:
df.reset_index(inplace=True)
df

   name  math  eng  mus  phy
0  stu1    90   98   90  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [200]:
dff = df.transpose()
dff

         0     1     2
name  stu1  stu2  stu3
math    90    80    70
eng     98    89    95
mus     90    95   100
phy    100    90    90

In [202]:
dff.T

   name math eng  mus  phy
0  stu1   90  98   90  100
1  stu2   80  89   95   90
2  stu3   70  95  100   90

In [204]:
df

   name  math  eng  mus  phy
0  stu1    90   98   90  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [206]:
ndf = df.set_index(["name"])
ndf

      math  eng  mus  phy
name
stu1    90   98   90  100
stu2    80   89   95   90
stu3    70   95  100   90

In [208]:
ndf.set_index("mus")

     math  eng  phy
mus
90     90   98  100
95     80   89   90
100    70   95   90

In [210]:
ndf.reset_index(inplace=True)
ndf

   name  math  eng  mus  phy
0  stu1    90   98   90  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [214]:
ndf.set_index("mus")

     name  math  eng  phy
mus
90   stu1    90   98  100
95   stu2    80   89   90
100  stu3    70   95   90

In [216]:
ndf3 = ndf.set_index(["math", "mus"])
ndf3

          name  eng  phy
math mus
90   90   stu1   98  100
80   95   stu2   89   90
70   100  stu3   95   90

In [218]:
dict_data = {"c0": [1,2,3], 
             "c1": [4,5,6], 
             "c2": [7,8,9], 
             "c3": [10,11,12], 
             "c4": [13,14,15]}

df = pd.DataFrame(dict_data, index=["r0", "r1", "r2"])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [220]:
new_index = ["r0", "r1", "r2", "r3", "r4"]

ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [222]:
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [227]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [229]:
ndf= df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [231]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [233]:
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [235]:
df.sort_values(by="c1", ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

# Series Operations

In [238]:
student1 = pd.Series({"kor": 100, "eng": 80, "math": 90})
student1

kor     100
eng      80
math     90
dtype: int64

In [240]:
student1 / 200

kor     0.50
eng     0.40
math    0.45
dtype: float64

In [242]:
student2 = pd.Series({"kor": 80, "eng": 90, "math": 80})
student2

kor     80
eng     90
math    80
dtype: int64

In [252]:
addition = student1+student2

In [254]:
substraction= student1-student2

In [256]:
multiplication = student1*student2

In [258]:
division = student1/student2

In [260]:
result = pd.DataFrame([addition, substraction, multiplication, division],
                      index = ["addition", "substraction", "multiplication", "division"]
                     )
result

                    kor          eng      math
addition         180.00   170.000000   170.000
substraction      20.00   -10.000000    10.000
multiplication  8000.00  7200.000000  7200.000
division           1.25     0.888889     1.125

In [262]:
student1 = pd.Series({"kor": np.nan, "eng": 80, "math": 90})
student1

kor      NaN
eng     80.0
math    90.0
dtype: float64

In [264]:
student2 = pd.Series({"math": 80, "kor": 80})
student2

math    80
kor     80
dtype: int64

In [266]:
addition = student1+student2
substraction= student1-student2
multiplication = student1*student2
division = student1/student2

In [268]:
result = pd.DataFrame([addition, substraction, multiplication, division],
                      index = ["addition", "substraction", "multiplication", "division"]
                     )
result

                eng  kor      math
addition        NaN  NaN   170.000
substraction    NaN  NaN    10.000
multiplication  NaN  NaN  7200.000
division        NaN  NaN     1.125

In [270]:
student1, student2

(kor      NaN
 eng     80.0
 math    90.0
 dtype: float64,
 math    80
 kor     80
 dtype: int64)

In [272]:
addition = student1.add(student2, fill_value=0)
substraction= student1.sub(student2, fill_value=0)
multiplication = student1.mul(student2, fill_value=0)
division = student1.div(student2, fill_value=0)

In [274]:
result = pd.DataFrame([addition, substraction, multiplication, division],
                      index = ["addition", "substraction", "multiplication", "division"]
                     )
result

                 eng   kor      math
addition        80.0  80.0   170.000
substraction    80.0 -80.0    10.000
multiplication   0.0   0.0  7200.000
division         inf   0.0     1.125

# DataFrame Operations

In [277]:
import seaborn as sns

In [279]:
titanic = sns.load_dataset("titanic")

In [281]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [283]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [292]:
df = titanic.loc[:, ["age","fare"]]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [296]:
addition = df+10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [300]:
substraction = addition -df
substraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

In [302]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

# Merge

In [355]:
dfA = pd.DataFrame({
    'Name':'Harry Potter,David Baker,John Smith,Juan Martinez,Jane Connor'.split(','),
    'Gender':'Male Male Male Male Female'.split(),
    'Age':[23,31,22,36,30]
    
})
dfA

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [307]:
dfB = pd.DataFrame({
    'Name':'John Smith,Alex Du Bois,Joanne Rowling,Jane Connor'.split(','),
    'Position':'Intern,Team Lead,Manager,Manager'.split(','),
    'Wage':[25000,75000,90000,70000]
    
})
dfB

             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [309]:
pd.merge(dfA, dfB, on="Name")

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [313]:
dfB2 = dfB.rename(columns={"Name": "Nombre"})
dfB2

           Nombre   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [315]:
pd.merge(dfA, dfB2, left_on="Name", right_on="Nombre", how="inner")

          Name  Gender  Age       Nombre Position   Wage
0   John Smith    Male   22   John Smith   Intern  25000
1  Jane Connor  Female   30  Jane Connor  Manager  70000

In [317]:
pd.merge(dfA, dfB, on="Name", how="left")

            Name  Gender  Age Position     Wage
0   Harry Potter    Male   23      NaN      NaN
1    David Baker    Male   31      NaN      NaN
2     John Smith    Male   22   Intern  25000.0
3  Juan Martinez    Male   36      NaN      NaN
4    Jane Connor  Female   30  Manager  70000.0

In [319]:
pd.merge(dfA, dfB, on="Name", how="right")

             Name  Gender   Age   Position   Wage
0      John Smith    Male  22.0     Intern  25000
1    Alex Du Bois     NaN   NaN  Team Lead  75000
2  Joanne Rowling     NaN   NaN    Manager  90000
3     Jane Connor  Female  30.0    Manager  70000

In [321]:
pd.merge(dfA, dfB, on="Name", how="outer")

             Name  Gender   Age   Position     Wage
0    Alex Du Bois     NaN   NaN  Team Lead  75000.0
1     David Baker    Male  31.0        NaN      NaN
2    Harry Potter    Male  23.0        NaN      NaN
3     Jane Connor  Female  30.0    Manager  70000.0
4  Joanne Rowling     NaN   NaN    Manager  90000.0
5      John Smith    Male  22.0     Intern  25000.0
6   Juan Martinez    Male  36.0        NaN      NaN

In [323]:
pd.concat([dfA, dfB], sort=True)

    Age  Gender            Name   Position     Wage
0  23.0    Male    Harry Potter        NaN      NaN
1  31.0    Male     David Baker        NaN      NaN
2  22.0    Male      John Smith        NaN      NaN
3  36.0    Male   Juan Martinez        NaN      NaN
4  30.0  Female     Jane Connor        NaN      NaN
0   NaN     NaN      John Smith     Intern  25000.0
1   NaN     NaN    Alex Du Bois  Team Lead  75000.0
2   NaN     NaN  Joanne Rowling    Manager  90000.0
3   NaN     NaN     Jane Connor    Manager  70000.0

In [325]:
pd.concat([dfA, dfB], axis=1, sort=True)

            Name  Gender  Age            Name   Position     Wage
0   Harry Potter    Male   23      John Smith     Intern  25000.0
1    David Baker    Male   31    Alex Du Bois  Team Lead  75000.0
2     John Smith    Male   22  Joanne Rowling    Manager  90000.0
3  Juan Martinez    Male   36     Jane Connor    Manager  70000.0
4    Jane Connor  Female   30             NaN        NaN      NaN

In [333]:
pd.merge(dfA, dfB2, how="outer", left_on="Name", right_on="Nombre")

            Name  Gender   Age          Nombre   Position     Wage
0            NaN     NaN   NaN    Alex Du Bois  Team Lead  75000.0
1    David Baker    Male  31.0             NaN        NaN      NaN
2   Harry Potter    Male  23.0             NaN        NaN      NaN
3    Jane Connor  Female  30.0     Jane Connor    Manager  70000.0
4            NaN     NaN   NaN  Joanne Rowling    Manager  90000.0
5     John Smith    Male  22.0      John Smith     Intern  25000.0
6  Juan Martinez    Male  36.0             NaN        NaN      NaN

In [335]:
dfA

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [339]:
dfA.sort_values(by="Age")

            Name  Gender  Age
2     John Smith    Male   22
0   Harry Potter    Male   23
4    Jane Connor  Female   30
1    David Baker    Male   31
3  Juan Martinez    Male   36

In [341]:
dfA.sort_values(by="Age", ascending=False)

            Name  Gender  Age
3  Juan Martinez    Male   36
1    David Baker    Male   31
4    Jane Connor  Female   30
0   Harry Potter    Male   23
2     John Smith    Male   22

In [343]:
dfA.sort_values(by="Age", ascending=False).index

Index([3, 1, 4, 0, 2], dtype='int64')

In [345]:
dfA.index

RangeIndex(start=0, stop=5, step=1)

In [347]:
dfA.sort_values(by=["Age", "Gender"], ascending=False)

            Name  Gender  Age
3  Juan Martinez    Male   36
1    David Baker    Male   31
4    Jane Connor  Female   30
0   Harry Potter    Male   23
2     John Smith    Male   22

In [357]:
dfA.iloc[4,2] = 31

In [359]:
dfA

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   31

In [363]:
dfA.sort_values(by=["Age", "Gender"], ascending=True)

            Name  Gender  Age
2     John Smith    Male   22
0   Harry Potter    Male   23
4    Jane Connor  Female   31
1    David Baker    Male   31
3  Juan Martinez    Male   36

# Multi Index

In [368]:
my_header = ['a', 'b', 'c']
my_index_out = ['G1']*3 + ['G2']*3
my_index_in  = [1,2,3]*2
my_index_zipped = list(zip(my_index_out, my_index_in))

In [370]:
my_index_out

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [372]:
my_index_in

[1, 2, 3, 1, 2, 3]

In [374]:
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [376]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [378]:
df = pd.DataFrame(data=np.random.randn(6,3),
                  index=my_index,
                  columns=my_header)
df

             a         b         c
G1 1  0.216023 -0.347475  0.683553
   2  0.494238 -1.267590  0.177490
   3  1.018697 -0.144699 -2.625862
G2 1 -0.354267 -1.564222 -1.136493
   2 -0.055509  1.127753 -0.446972
   3  2.262244  1.151783 -0.024177

In [380]:
df.loc[("G1",1)]

a    0.216023
b   -0.347475
c    0.683553
Name: (G1, 1), dtype: float64

# Groupby y Pivot

In [383]:
df = pd.read_csv("data_studentlist.csv")

In [385]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [387]:
df.groupby(["gender", "bloodtype"])

In [389]:
df.groupby(["gender", "bloodtype"])["height"]

In [391]:
df.groupby(["gender", "bloodtype"])["height"].mean()

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [393]:
my_dict = {'Size': list('LLMMMSSSS'),
           'Type': list('AAABBAABB'),
           'Location':[ 'L'+x for x in '111221221'],
           'A':[1,2,2,3,3,4,5,6,7],
           'B':[2,4,5,5,6,6,8,9,9]}
my_dict

{'Size': ['L', 'L', 'M', 'M', 'M', 'S', 'S', 'S', 'S'],
 'Type': ['A', 'A', 'A', 'B', 'B', 'A', 'A', 'B', 'B'],
 'Location': ['L1', 'L1', 'L1', 'L2', 'L2', 'L1', 'L2', 'L2', 'L1'],
 'A': [1, 2, 2, 3, 3, 4, 5, 6, 7],
 'B': [2, 4, 5, 5, 6, 6, 8, 9, 9]}

In [395]:
df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [397]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B")

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [399]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0)

Location    L1   L2
Size Type
L    A     3.0  0.0
M    A     5.0  0.0
     B     0.0  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [401]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=np.median)

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\3077810037.py:1: FutureWarning: The provided callable <function median at 0x0000018890371580> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=np.median)

Location    L1   L2
Size Type
L    A     3.0  0.0
M    A     5.0  0.0
     B     0.0  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [403]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=sum)

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\521805819.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=sum)

Location   L1  L2
Size Type
L    A      6   0
M    A      5   0
     B      0  11
S    A      6   8
     B      9   9

In [405]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=max)

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\4016741169.py:1: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=max)

Location   L1  L2
Size Type
L    A      4   0
M    A      5   0
     B      0   6
S    A      6   8
     B      9   9

In [407]:
df.pivot_table(index=["Size", "Type"], columns="Location", values="B", fill_value=0, aggfunc=lambda x: sum(x))

Location   L1  L2
Size Type
L    A      6   0
M    A      5   0
     B      0  11
S    A      6   8
     B      9   9

In [409]:
df.groupby(["Size", "Type"])[["A","B"]].mean()

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [413]:
df.pivot_table(index=["Size", "Type"], values=["A", "B"], aggfunc={"A": np.max, "B": np.min})

C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\3762740779.py:1: FutureWarning: The provided callable <function max at 0x00000188902460C0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.pivot_table(index=["Size", "Type"], values=["A", "B"], aggfunc={"A": np.max, "B": np.min})
C:\Users\cfp\AppData\Local\Temp\ipykernel_2888\3762740779.py:1: FutureWarning: The provided callable <function min at 0x0000018890246200> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.pivot_table(index=["Size", "Type"], values=["A", "B"], aggfunc={"A": np.max, "B": np.min})

           A  B
Size Type
L    A     2  2
M    A     2  5
     B     3  5
S    A     5  6
     B     7  9

In [419]:
df

          name  math  eng  music  phys_tra
0   hongildong    90   98     85       100
1  hongeeedong    80   89     95        90
2   honsamdong    70   95    100        90

In [423]:
df = df.set_index("name")

In [425]:
df.sum(axis=0)

math        240
eng         282
music       280
phys_tra    280
dtype: int64

In [427]:
df.sum(axis=1)

name
hongildong     373
hongeeedong    354
honsamdong     355
dtype: int64

In [429]:
df.mean(axis=0, skipna=False)

math        80.000000
eng         94.000000
music       93.333333
phys_tra    93.333333
dtype: float64

In [431]:
df.describe()

       math        eng       music    phys_tra
count   3.0   3.000000    3.000000    3.000000
mean   80.0  94.000000   93.333333   93.333333
std    10.0   4.582576    7.637626    5.773503
min    70.0  89.000000   85.000000   90.000000
25%    75.0  92.000000   90.000000   90.000000
50%    80.0  95.000000   95.000000   90.000000
75%    85.0  96.500000   97.500000   95.000000
max    90.0  98.000000  100.000000  100.000000

In [433]:
df.count(axis=0)

math        3
eng         3
music       3
phys_tra    3
dtype: int64

In [435]:
df.corr()

              math       eng     music  phys_tra
math      1.000000  0.327327 -0.981981  0.866025
eng       0.327327  1.000000 -0.500000  0.755929
music    -0.981981 -0.500000  1.000000 -0.944911
phys_tra  0.866025  0.755929 -0.944911  1.000000

In [437]:
df.math.corr(df.music)

-0.9819805060619656

In [439]:
df.corrwith(df.math)

math        1.000000
eng         0.327327
music      -0.981981
phys_tra    0.866025
dtype: float64